/*Copyright 2016 Timofey Rechkalov <ntsdk@yandex.ru>

Licensed under the Apache License, Version 2.0 (the "License");
you may not use this file except in compliance with the License.
You may obtain a copy of the License at

http://www.apache.org/licenses/LICENSE-2.0

Unless required by applicable law or agreed to in writing, software
distributed under the License is distributed on an "AS IS" BASIS,
WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
See the License for the specific language governing permissions and
   limitations under the License. */

"use strict";

(function(exports){

	exports.data = {
	        "Meta": {
	            "name": "Выборы в Неизведанске",
	            "date": "",
	            "preGameDate": "",
	            "description": "",
	            "saveTime": "2016-09-05T00:39:35.327Z"
	          },
	          "Characters": {
	            "22": {
	              "name": "22",
	              "Расположение участка": "Школа №333",
	              "Ответственный": "Честный И.И.",
	              "Район": "Район 1"
	            },
	            "34": {
	              "name": "34",
	              "Расположение участка": "Школа №334",
	              "Ответственный": "Надежный М.М.",
	              "Район": "Район 1"
	            },
	            "35": {
	              "name": "35",
	              "Расположение участка": "Школа №335",
	              "Ответственный": "Добрый Тюльпан Тайфунович",
	              "Район": "Район 1"
	            },
	            "45": {
	              "name": "45",
	              "Расположение участка": "Школа №336",
	              "Ответственный": "Хороший Г.Г.",
	              "Район": "Район 1"
	            },
	            "56": {
	              "name": "56",
	              "Расположение участка": "Школа №337",
	              "Ответственный": "Уверенный А.С.",
	              "Район": "Район 1"
	            },
	            "67": {
	              "name": "67",
	              "Расположение участка": "Школа №338",
	              "Ответственный": "Зоркий П.Р.",
	              "Район": "Район 1"
	            },
	            "77": {
	              "name": "77",
	              "Расположение участка": "Школа №339",
	              "Ответственный": "Веселый А.К.",
	              "Район": "Район 2"
	            },
	            "87": {
	              "name": "87",
	              "Расположение участка": "Школа №3310",
	              "Ответственный": "Праздник С.М.",
	              "Район": "Район 2"
	            },
	            "90": {
	              "name": "90",
	              "Расположение участка": "Школа №3311",
	              "Ответственный": "Сильный В.Ф.",
	              "Район": "Район 2"
	            },
	            "91": {
	              "name": "91",
	              "Расположение участка": "Школа №3312",
	              "Ответственный": "Брутальный Д.В.",
	              "Район": "Район 2"
	            },
	            "98": {
	              "name": "98",
	              "Расположение участка": "Школа №3313",
	              "Ответственный": "Умничков Ш.Я.",
	              "Район": "Район 2"
	            },
	            "Город": {
	              "name": "Город",
	              "Расположение участка": "",
	              "Ответственный": "",
	              "Район": "без района"
	            },
	            "Район 1": {
	              "name": "Район 1",
	              "Расположение участка": "",
	              "Ответственный": "",
	              "Район": "без района"
	            },
	            "Район 2": {
	              "name": "Район 2",
	              "Расположение участка": "",
	              "Ответственный": "",
	              "Район": "без района"
	            }
	          },
	          "ProfileSettings": [
	            {
	              "name": "Расположение участка",
	              "type": "string",
	              "value": ""
	            },
	            {
	              "name": "Ответственный",
	              "type": "string",
	              "value": ""
	            },
	            {
	              "name": "Район",
	              "type": "enum",
	              "value": "Район 1,Район 2,без района"
	            }
	          ],
	          "Stories": {
	            "2008": {
	              "name": "2008",
	              "story": "",
	              "characters": {},
	              "events": [],
	              "electors": {
	                "22": {
	                  "10": "300",
	                  "12": "800",
	                  "14": "1600",
	                  "16": "2000",
	                  "18": "2200",
	                  "20": -1,
	                  "total": "3800"
	                },
	                "34": {
	                  "10": "500",
	                  "12": "1000",
	                  "14": "2000",
	                  "16": "2400",
	                  "18": "2600",
	                  "20": -1,
	                  "total": "4600"
	                },
	                "35": {
	                  "10": "300",
	                  "12": "1000",
	                  "14": "1800",
	                  "16": "2600",
	                  "18": "3000",
	                  "20": -1,
	                  "total": "5200"
	                },
	                "45": {
	                  "10": "200",
	                  "12": "800",
	                  "14": "1500",
	                  "16": "1800",
	                  "18": "2000",
	                  "20": -1,
	                  "total": "3600"
	                },
	                "56": {
	                  "10": "200",
	                  "12": "700",
	                  "14": "1400",
	                  "16": "1800",
	                  "18": "2200",
	                  "20": -1,
	                  "total": "4300"
	                },
	                "67": {
	                  "10": "400",
	                  "12": "1000",
	                  "14": "1600",
	                  "16": "2000",
	                  "18": "2300",
	                  "20": -1,
	                  "total": "4000"
	                },
	                "77": {
	                  "10": "300",
	                  "12": "1000",
	                  "14": "1600",
	                  "16": "2200",
	                  "18": "2200",
	                  "20": -1,
	                  "total": "4350"
	                },
	                "87": {
	                  "10": "200",
	                  "12": "1200",
	                  "14": "2000",
	                  "16": "2700",
	                  "18": "3000",
	                  "20": -1,
	                  "total": "5000"
	                },
	                "90": {
	                  "10": "500",
	                  "12": "1100",
	                  "14": "1700",
	                  "16": "2100",
	                  "18": "2400",
	                  "20": -1,
	                  "total": "4400"
	                },
	                "91": {
	                  "10": "250",
	                  "12": "900",
	                  "14": "1400",
	                  "16": "1900",
	                  "18": "2000",
	                  "20": -1,
	                  "total": "3200"
	                },
	                "98": {
	                  "10": "250",
	                  "12": "1000",
	                  "14": "1600",
	                  "16": "2300",
	                  "18": "2500",
	                  "20": -1,
	                  "total": "4100"
	                },
	                "Город": {
	                  "10": "3400",
	                  "12": "10500",
	                  "14": "18200",
	                  "16": "23800",
	                  "18": "26400",
	                  "20": -1,
	                  "total": "46550"
	                },
	                "Район 1": {
	                  "10": "1900",
	                  "12": "5300",
	                  "14": "9900",
	                  "16": "12600",
	                  "18": "14300",
	                  "20": -1,
	                  "total": "25500"
	                },
	                "Район 2": {
	                  "10": "1500",
	                  "12": "5200",
	                  "14": "8300",
	                  "16": "11200",
	                  "18": "12100",
	                  "20": -1,
	                  "total": "21050"
	                }
	              }
	            },
	            "2010": {
	              "name": "2010",
	              "story": "",
	              "characters": {},
	              "events": [],
	              "electors": {
	                "22": {
	                  "10": "200",
	                  "12": "600",
	                  "14": "1100",
	                  "16": "1300",
	                  "18": "1400",
	                  "20": -1,
	                  "total": ""
	                },
	                "34": {
	                  "10": "",
	                  "12": "800",
	                  "14": "1300",
	                  "16": "1600",
	                  "18": "1800",
	                  "20": -1,
	                  "total": "4600"
	                },
	                "35": {
	                  "10": "200",
	                  "12": "",
	                  "14": "1300",
	                  "16": "1500",
	                  "18": "1600",
	                  "20": -1,
	                  "total": "4600"
	                },
	                "45": {
	                  "10": "200",
	                  "12": "600",
	                  "14": "",
	                  "16": "1200",
	                  "18": "1500",
	                  "20": -1,
	                  "total": "3600"
	                },
	                "56": {
	                  "10": "200",
	                  "12": "600",
	                  "14": "1000",
	                  "16": "",
	                  "18": "1500",
	                  "20": -1,
	                  "total": "4400"
	                },
	                "67": {
	                  "10": "150",
	                  "12": "700",
	                  "14": "1100",
	                  "16": "1300",
	                  "18": "",
	                  "20": -1,
	                  "total": "2800"
	                },
	                "77": {
	                  "10": "150",
	                  "12": "700",
	                  "14": "1200",
	                  "16": "1500",
	                  "18": "1700",
	                  "20": -1,
	                  "total": "4300"
	                },
	                "87": {
	                  "10": "250",
	                  "12": "800",
	                  "14": "1400",
	                  "16": "1700",
	                  "18": "1900",
	                  "20": -1,
	                  "total": "5000"
	                },
	                "90": {
	                  "10": "200",
	                  "12": "700",
	                  "14": "1200",
	                  "16": "1400",
	                  "18": "1500",
	                  "20": -1,
	                  "total": "4200"
	                },
	                "91": {
	                  "10": "150",
	                  "12": "600",
	                  "14": "900",
	                  "16": "1200",
	                  "18": "1300",
	                  "20": -1,
	                  "total": "3200"
	                },
	                "98": {
	                  "10": "250",
	                  "12": "800",
	                  "14": "1300",
	                  "16": "1600",
	                  "18": "1800",
	                  "20": -1,
	                  "total": "4000"
	                },
	                "Город": {
	                  "10": "2150",
	                  "12": "7600",
	                  "14": "12800",
	                  "16": "15600",
	                  "18": "17500",
	                  "20": -1,
	                  "total": "44500"
	                },
	                "Район 1": {
	                  "10": "1150",
	                  "12": "4000",
	                  "14": "6800",
	                  "16": "8200",
	                  "18": "9300",
	                  "20": -1,
	                  "total": "23800"
	                },
	                "Район 2": {
	                  "10": "1000",
	                  "12": "3600",
	                  "14": "6000",
	                  "16": "7400",
	                  "18": "8200",
	                  "20": -1,
	                  "total": "20700"
	                }
	              }
	            },
	            "2012": {
	              "name": "2012",
	              "story": "",
	              "characters": {},
	              "events": [],
	              "electors": {
	                "22": {
	                  "10": "200",
	                  "12": "900",
	                  "14": -1,
	                  "16": -1,
	                  "18": -1,
	                  "20": -1,
	                  "total": "3600"
	                },
	                "34": {
	                  "10": "200",
	                  "12": "1100",
	                  "14": -1,
	                  "16": -1,
	                  "18": -1,
	                  "20": -1,
	                  "total": "4500"
	                },
	                "35": {
	                  "10": "300",
	                  "12": "1300",
	                  "14": -1,
	                  "16": -1,
	                  "18": -1,
	                  "20": -1,
	                  "total": "4800"
	                },
	                "45": {
	                  "10": "300",
	                  "12": "900",
	                  "14": -1,
	                  "16": -1,
	                  "18": -1,
	                  "20": -1,
	                  "total": "3400"
	                },
	                "56": {
	                  "10": "300",
	                  "12": "1000",
	                  "14": -1,
	                  "16": -1,
	                  "18": -1,
	                  "20": -1,
	                  "total": "4400"
	                },
	                "67": {
	                  "10": "200",
	                  "12": "1100",
	                  "14": -1,
	                  "16": -1,
	                  "18": -1,
	                  "20": -1,
	                  "total": "3600"
	                },
	                "77": {
	                  "10": "300",
	                  "12": "1100",
	                  "14": -1,
	                  "16": -1,
	                  "18": -1,
	                  "20": -1,
	                  "total": "4200"
	                },
	                "87": {
	                  "10": "400",
	                  "12": "1400",
	                  "14": -1,
	                  "16": -1,
	                  "18": -1,
	                  "20": -1,
	                  "total": "5000"
	                },
	                "90": {
	                  "10": "300",
	                  "12": "1100",
	                  "14": -1,
	                  "16": -1,
	                  "18": -1,
	                  "20": -1,
	                  "total": "4000"
	                },
	                "91": {
	                  "10": "200",
	                  "12": "750",
	                  "14": -1,
	                  "16": -1,
	                  "18": -1,
	                  "20": -1,
	                  "total": "3200"
	                },
	                "98": {
	                  "10": "250",
	                  "12": "1000",
	                  "14": -1,
	                  "16": -1,
	                  "18": -1,
	                  "20": -1,
	                  "total": "4000"
	                },
	                "Город": {
	                  "10": "2950",
	                  "12": "11650",
	                  "14": -1,
	                  "16": -1,
	                  "18": -1,
	                  "20": -1,
	                  "total": "44700"
	                },
	                "Район 1": {
	                  "10": "1500",
	                  "12": "6300",
	                  "14": -1,
	                  "16": -1,
	                  "18": -1,
	                  "20": -1,
	                  "total": "24300"
	                },
	                "Район 2": {
	                  "10": "1450",
	                  "12": "5350",
	                  "14": -1,
	                  "16": -1,
	                  "18": -1,
	                  "20": -1,
	                  "total": "20400"
	                }
	              }
	            }
	          },
	          "Settings": {
	            "BriefingPreview": {},
	            "Stories": {
	              "storyName": "2010"
	            },
	            "CharacterProfile": {
	              "characterName": "22"
	            }
	          },
	          "Version": "0.4.4u1",
	          "Log": [
	            [
	              "user",
	              "2016-09-04T23:12:41.235Z",
	              "createCharacter",
	              "[\"Город\"]"
	            ],
	            [
	              "user",
	              "2016-09-04T23:12:48.355Z",
	              "createCharacter",
	              "[\"Район 1\"]"
	            ],
	            [
	              "user",
	              "2016-09-04T23:12:51.986Z",
	              "createCharacter",
	              "[\"Район 2\"]"
	            ],
	            [
	              "user",
	              "2016-09-04T23:13:04.635Z",
	              "createProfileItem",
	              "[\"Район\",\"enum\",\"_\",true,2]"
	            ],
	            [
	              "user",
	              "2016-09-04T23:13:14.810Z",
	              "updateDefaultValue",
	              "[\"Район\",\"Район 1,Район 2\"]"
	            ],
	            [
	              "user",
	              "2016-09-05T00:37:54.231Z",
	              "updateDefaultValue",
	              "[\"Район\",\"Район 1,Район 2,без района\"]"
	            ]
	          ]
	        };

})(typeof exports === 'undefined'? this['BaseExample']={}: exports);